# STUDENTS PERFORMANCE
Analyzing a database on students performance through SQL queries.

Database from https://www.kaggle.com/spscientist/students-performance-in-exams

## Installing Packages for SQL compatibility

In [64]:
%%!
pip install ipython-sql
pip install pandas

['Requirement already satisfied: ipython-sql in c:\\users\\personal\\miniconda3\\lib\\site-packages (0.4.0)',
 'Requirement already satisfied: prettytable<1 in c:\\users\\personal\\miniconda3\\lib\\site-packages (from ipython-sql) (0.7.2)',
 'Requirement already satisfied: sqlparse in c:\\users\\personal\\miniconda3\\lib\\site-packages (from ipython-sql) (0.3.1)',
 'Requirement already satisfied: sqlalchemy>=0.6.7 in c:\\users\\personal\\miniconda3\\lib\\site-packages (from ipython-sql) (1.3.19)',
 'Requirement already satisfied: six in c:\\users\\personal\\miniconda3\\lib\\site-packages (from ipython-sql) (1.15.0)',
 'Requirement already satisfied: ipython-genutils>=0.1.0 in c:\\users\\personal\\miniconda3\\lib\\site-packages (from ipython-sql) (0.2.0)',
 'Requirement already satisfied: ipython>=1.0 in c:\\users\\personal\\miniconda3\\lib\\site-packages (from ipython-sql) (7.18.1)',
 'Requirement already satisfied: pickleshare in c:\\users\\personal\\miniconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)',
 'Requirement already satisfied: jedi>=0.10 in c:\\users\\personal\\miniconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (0.17.2)',
 'Requirement already satisfied: backcall in c:\\users\\personal\\miniconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)',
 'Requirement already satisfied: colorama; sys_platform == "win32" in c:\\users\\personal\\miniconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (0.4.3)',
 'Requirement already satisfied: decorator in c:\\users\\personal\\miniconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (4.4.2)',
 'Requirement already satisfied: traitlets>=4.2 in c:\\users\\personal\\miniconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (5.0.5)',
 'Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\\users\\personal\\miniconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (3.0.8)',
 'Requirement already satisfied: pygments in c:\\users\\personal\\miniconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (2.7.1)',
 'Requirement already satisfied: setuptools>=18.5 in c:\\users\\personal\\miniconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (50.3.0.post20201006)',
 'Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\\users\\personal\\miniconda3\\lib\\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.7.0)',
 'Requirement already satisfied: wcwidth in c:\\users\\personal\\miniconda3\\lib\\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)']

## Importing Libaries

In [65]:
import pandas as pd
import sqlite3
%load_ext sql
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## Allow SQL Query on Dataframe Using Pandas

In [66]:
# Load tables from CSV files
with open('StudentsPerformance.csv') as f: Students = pd.read_csv(f, index_col=0)
%sql drop table if exists Students;
%sql --persist Students

 * sqlite://
Done.
 * sqlite://

'Persisted students'

## Show First 5 Rows of the Dataframe

In [67]:
%%sql
SELECT *
FROM Students
LIMIT 5;

 * sqlite://
Done.

[('female', 'group B', "bachelor's degree", 'standard', 'none', 72, 72, 74),
 ('female', 'group C', 'some college', 'standard', 'completed', 69, 90, 88),
 ('female', 'group B', "master's degree", 'standard', 'none', 90, 95, 93),
 ('male', 'group A', "associate's degree", 'free/reduced', 'none', 47, 57, 44),
 ('male', 'group C', 'some college', 'standard', 'none', 76, 78, 75)]

## Queries on Databases

### Identify the amount of data in the database

In [68]:
%%sql
SELECT COUNT(*) as "Total Amount of Data"
FROM Students;

 * sqlite://
Done.

[(1000,)]

### Categorize the Databases by the different Columns

**Gender**

In [74]:
%%sql
SELECT gender as Gender, COUNT(gender) as Total
FROM Students
GROUP BY gender
ORDER BY COUNT(gender) desc;

 * sqlite://
Done.

[('female', 518), ('male', 482)]

**Race/Ethnicity**

In [75]:
%%sql
SELECT race as "Race/Enthnicity", Count(race) as Total
FROM Students
GROUP BY race
ORDER BY COUNT(race) desc;

 * sqlite://
Done.

[('group C', 319),
 ('group D', 262),
 ('group B', 190),
 ('group E', 140),
 ('group A', 89)]

**Education Level**

In [76]:
%%sql
SELECT education_level as "Education level", Count(education_level) as Total
FROM Students
GROUP BY education_level
ORDER BY COUNT(education_level) desc;

 * sqlite://
Done.

[('some college', 226),
 ("associate's degree", 222),
 ('high school', 196),
 ('some high school', 179),
 ("bachelor's degree", 118),
 ("master's degree", 59)]

**Test Preparation Course Status**

In [77]:
%%sql
SELECT test_preparation_course as "Status of Test Prep. Course", Count(test_preparation_course) as Total
FROM Students
GROUP BY test_preparation_course
ORDER BY COUNT(test_preparation_course) desc;

 * sqlite://
Done.

[('none', 642), ('completed', 358)]

**Math Score Range**

According to the query, students are most often found with the Math Score between 60 - 70.

In [92]:
%%sql
SELECT CASE
    WHEN math_score BETWEEN 0 AND 10 THEN '0 - 10'
    WHEN math_score BETWEEN 10 AND 20 THEN '10 - 20'
    WHEN math_score BETWEEN 20 AND 30 THEN '20 - 30'
    WHEN math_score BETWEEN 30 AND 40 THEN '30 - 40'
    WHEN math_score BETWEEN 40 AND 50 THEN '40 - 50'
    WHEN math_score BETWEEN 50 AND 60 THEN '50 - 60'
    WHEN math_score BETWEEN 60 AND 70 THEN '60 - 70'
    WHEN math_score BETWEEN 70 AND 80 THEN '70 - 80'
    WHEN math_score BETWEEN 80 AND 90 THEN '80 - 90'
    WHEN math_score BETWEEN 90 AND 100 THEN '90 - 100'
    END [Math Score Range], COUNT(*) AS Total
FROM Students
GROUP BY [Math Score Range]
ORDER BY [Math Score Range] desc;

 * sqlite://
Done.

[('90 - 100', 50),
 ('80 - 90', 126),
 ('70 - 80', 215),
 ('60 - 70', 270),
 ('50 - 60', 189),
 ('40 - 50', 100),
 ('30 - 40', 34),
 ('20 - 30', 12),
 ('10 - 20', 2),
 ('0 - 10', 2)]

In [97]:
%%sql
SELECT CASE
    WHEN reading_score BETWEEN 0 AND 10 THEN '0 - 10'
    WHEN reading_score BETWEEN 11 AND 20 THEN '10 - 20'
    WHEN reading_score BETWEEN 21 AND 30 THEN '20 - 30'
    WHEN reading_score BETWEEN 31 AND 40 THEN '30 - 40'
    WHEN reading_score BETWEEN 41 AND 50 THEN '40 - 50'
    WHEN reading_score BETWEEN 51 AND 60 THEN '50 - 60'
    WHEN reading_score BETWEEN 61 AND 70 THEN '60 - 70'
    WHEN reading_score BETWEEN 71 AND 80 THEN '70 - 80'
    WHEN reading_score BETWEEN 81 AND 90 THEN '80 - 90'
    WHEN reading_score BETWEEN 91 AND 100 THEN '90 - 100'
    END [Reading Score Range], COUNT(*) AS Total
FROM Students
GROUP BY [Reading Score Range]
ORDER BY [Reading Score Range] desc;

 * sqlite://
Done.

[('90 - 100', 62),
 ('80 - 90', 173),
 ('70 - 80', 252),
 ('60 - 70', 238),
 ('50 - 60', 178),
 ('40 - 50', 70),
 ('30 - 40', 19),
 ('20 - 30', 7),
 ('10 - 20', 1)]

**Writing Score Range**

According to the query, students are most often found with the Writing Score between 60 - 80 (There are 5 students more students found in the range of 70-80 than that of 60-70.

In [91]:
%%sql
SELECT CASE
    WHEN writing_score BETWEEN 0 AND 10 THEN '0 - 10'
    WHEN writing_score BETWEEN 10 AND 20 THEN '10 - 20'
    WHEN writing_score BETWEEN 20 AND 30 THEN '20 - 30'
    WHEN writing_score BETWEEN 30 AND 40 THEN '30 - 40'
    WHEN writing_score BETWEEN 40 AND 50 THEN '40 - 50'
    WHEN writing_score BETWEEN 50 AND 60 THEN '50 - 60'
    WHEN writing_score BETWEEN 60 AND 70 THEN '60 - 70'
    WHEN writing_score BETWEEN 70 AND 80 THEN '70 - 80'
    WHEN writing_score BETWEEN 80 AND 90 THEN '80 - 90'
    WHEN writing_score BETWEEN 90 AND 100 THEN '90 - 100'
    END [Writing Score Range], COUNT(*) AS Total
FROM Students
GROUP BY [Writing Score Range]
ORDER BY [Writing Score Range] desc;

 * sqlite://
Done.

[('90 - 100', 68),
 ('80 - 90', 140),
 ('70 - 80', 248),
 ('60 - 70', 243),
 ('50 - 60', 177),
 ('40 - 50', 89),
 ('30 - 40', 25),
 ('20 - 30', 7),
 ('10 - 20', 2),
 ('0 - 10', 1)]